In [7]:
import numpy as np
import pandas as pd

In [8]:
house = pd.read_csv("Pune house data.csv")
house.head()

,area_type,availability,size,society,total_sqft,bath,balcony,price,site_location
0,Super built-up Area,19-Dec,2 BHK,Coomee,1056,2.0,1.0,39.07,Alandi Road
1,Plot Area,Ready To Move,4 Bedroom,Theanmp,2600,5.0,3.0,120.00,Ambegaon Budruk
2,Built-up Area,Ready To Move,3 BHK,NaN,1440,2.0,3.0,62.00,Anandnagar
3,Super built-up Area,Ready To Move,3 BHK,Soiewre,1521,3.0,1.0,95.00,Aundh
4,Super built-up Area,Ready To Move,2 BHK,NaN,1200,2.0,1.0,51.00,Aundh Road

In [4]:
house.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   area_type      13320 non-null  object
 1   availability   13320 non-null  object
 2   size           13304 non-null  object
 3   society        7818 non-null   object
 4   total_sqft     13320 non-null  object
 5   bath           13247 non-null  float64
 6   balcony        12711 non-null  float64
 7   price          13320 non-null  float64
 8   site_location  13319 non-null  object
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [9]:
house.drop(columns=["area_type", "availability", "society"], inplace=True)

In [10]:
house.head()

        size total_sqft  bath  balcony   price    site_location
0      2 BHK       1056   2.0      1.0   39.07      Alandi Road
1  4 Bedroom       2600   5.0      3.0  120.00  Ambegaon Budruk
2      3 BHK       1440   2.0      3.0   62.00       Anandnagar
3      3 BHK       1521   3.0      1.0   95.00            Aundh
4      2 BHK       1200   2.0      1.0   51.00       Aundh Road

In [11]:
house.shape

(13320, 6)

In [12]:
house.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   size           13304 non-null  object
 1   total_sqft     13320 non-null  object
 2   bath           13247 non-null  float64
 3   balcony        12711 non-null  float64
 4   price          13320 non-null  float64
 5   site_location  13319 non-null  object
dtypes: float64(3), object(3)
memory usage: 624.5+ KB

In [13]:
house['balcony'].value_counts()

balcony
2.0    5113
1.0    4897
3.0    1672
0.0    1029
Name: count, dtype: int64

In [14]:
house.dropna(inplace=True)

In [15]:
house.info()

<class 'pandas.core.frame.DataFrame'>
Index: 12710 entries, 0 to 13319
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   size           12710 non-null  object
 1   total_sqft     12710 non-null  object
 2   bath           12710 non-null  float64
 3   balcony        12710 non-null  float64
 4   price          12710 non-null  float64
 5   site_location  12710 non-null  object
dtypes: float64(3), object(3)
memory usage: 695.1+ KB